{"source":"Wired","author":"Grace Browne","title":"The Multiple Ways Climate Change Threatens to Make Migraines Worse","description":"Migraine sufferers are often triggered by the weather, and research suggests warming temperatures and more extreme weather events worsen attacks.","content":"Migraines have long had an intimate relationship with the elements. Alongside stress and hormones, fluctuations in meteorological conditions are one of the most commonly cited triggers for an attack.… [+3310 chars]","publishedAt":"2024-09-20T09:00:00Z","url":"https:\/\/www.wired.com\/story\/climate-change-could-make-migraines-worse\/"}
{"source":"Wired","author":"Dennis Mersereau","title":"Why Super Typhoons Like Yagi Are More Common Than You’d Think","description":"Unlike in the Atlantic, there is little to stop high-intensity storms forming in Southeast Asia, and climate change is making conditions even more perilous.","content":"The years first super typhoon erupted over the steamy waters of the western Pacific Ocean on Thursday as Yagi churned toward an eventual landfall in southern China.\r\nHaving formed as a tropical cyclo… [+1743 chars]","publishedAt":"2024-09-05T21:32:54Z","url":"https:\/\/www.wired.com\/story\/why-super-typhoons-like-yagi-are-more-common-than-youd-think\/"}
{"source":"Wired","author":"Chris Baraniuk","title":"The Cost of Lightning","description":"Exactly how climate change will impact lightning isn’t clear, but governments, public bodies, and the military are prepping for stormier weather.","content":"It was the terrible prospect of lightning one day striking the historic windmill that troubled Andrew Farrell. A bolt five times hotter than the surface of the sun instantly turning moisture in one o… [+3260 chars]","publishedAt":"2024-09-11T11:30:00Z","url":"https:\/\/www.wired.com\/story\/lightning-protection-damage-climate-change-extreme-weather\/"}
{"source":"Wired","author":"Will Knight","title":"The United Nations Wants to Treat AI With the Same Urgency as Climate Change","description":"A UN report proposes that the organization take a much more active role in the monitoring and oversight of AI.","content":"A United Nations report released today proposes having the international body oversee the first truly global effort for monitoring and governing artificial intelligence.\r\nThe report, produced by the … [+3067 chars]","publishedAt":"2024-09-19T05:00:00Z","url":"https:\/\/www.wired.com\/story\/united-nations-artificial-intelligence-report\/"}
{"source":"BBC News","author":null,"title":"Europe’s deadly floods are glimpse of future climate","description":"A new study shows that the record-breaking rainfall was made more likely and intense by climate change.","content":"Local residents rescue a woman from rising flood waters in the Romanian village of Slobozia Conachi\r\nCentral Europe's devastating floods were made much worse by climate change and offer a stark glimp… [+5380 chars]","publishedAt":"2024-09-25T03:06:20Z","url":"https:\/\/www.bbc.com\/news\/articles\/cn5zx2zx5xvo"}
{"source":"BBC News","author":null,"title":"Somalia: From Crisis to Renewal","description":"Climate change in Somalia is acting as a kind of 'chaos multiplier', making existing conflicts even more acute. So how is the country rising to the challenge?","content":"Climate change in Somalia is acting as a kind of 'chaos multiplier', making existing conflicts even more acute. So how is the country rising to the challenge? More","publishedAt":"2024-09-17T23:01:00Z","url":"https:\/\/www.bbc.co.uk\/iplayer\/episode\/m0023bvd\/somalia-from-crisis-to-renewal"}
{"source":"Gizmodo.com","author":"Rose Pastore","title":"Kamala Harris’s Patriotic Spin on Climate Action","description":"A study suggests that framing the issue in terms of American values holds promise.","content":"This story was originally published by Grist. Sign up for Grist’s weekly newsletter here.\r\nFreedom is often a Republican talking point, but Vice President Kamala Harris is trying to reclaim the conce… [+5869 chars]","publishedAt":"2024-09-13T13:45:56Z","url":"https:\/\/gizmodo.com\/kamala-harriss-patriotic-spin-on-climate-action-2000498462"}
{"source":"Ars Technica","author":"Howard Lee","title":"How did volcanism trigger climate change before the eruptions started?","description":"New dating of a major ancient warming shows warming started before major eruptions.","content":"Enlarge\/ Loads of lava: Kasbohm with a few solidified lava flows of the Columbia River Basalts.\r\n3\r\nAs our climate warms beyond its historical range, scientists increasingly need to study climates de… [+4030 chars]","publishedAt":"2024-09-08T11:00:53Z","url":"https:\/\/arstechnica.com\/science\/2024\/09\/how-did-volcanism-trigger-climate-change-before-the-eruptions-started\/"}
{"source":"Wired","author":"Richard Schiffman","title":"Breadfruit Is Here to Save the World","description":"This calorie-rich, nutrient-dense, and climate-resilient crop has the power to step in for more common staples that can’t handle global warming.","content":"Warming temperatures are making farming much more difficult in the tropics. Food systems across island nations in the Caribbean and Pacific are particularly vulnerable, being hit hard by a combinatio… [+3131 chars]","publishedAt":"2024-09-11T11:00:00Z","url":"https:\/\/www.wired.com\/story\/breadfruit-caribbean-pacific-climate-change-super-food\/"}
{"source":"The Verge","author":"Justine Calma","title":"Summer 2024 is already the hottest on record","description":"Heat has been record-breaking this summer, and it’s not over yet.","content":"Spectators and cyclists during a heatwave coinciding with the Paris Olympics on August 4th, 2024. | Photo by Magali Cohen \/ Hans Lucas \/ AFP via Getty Images\r\n\n \n\n The Northern Hemisphere just experi… [+2862 chars]","publishedAt":"2024-09-06T15:38:38Z","url":"https:\/\/www.theverge.com\/2024\/9\/6\/24237451\/summer-2024-is-already-the-hottest-on-record"}
{"source":"InsideClimate News","author":"Inside Climate News","title":"Droughts likely to be even longer in the future due to climate change","description":"Major climate reports may be underselling the risks of rising emissions.","content":"32\r\nDroughts in the coming decades could be longer than projected by current climate models, a new study published Wednesday in Nature warns.\r\nThe international team of scientists examined potential … [+3356 chars]","publishedAt":"2024-09-19T13:56:02Z","url":"https:\/\/insideclimatenews.org\/news\/18092024\/major-climate-reports-may-be-underestimating-drought-flood-risks\/"}
{"source":"NPR","author":"The NPR Network","title":"Hungry for new podcasts? Here are 8 episodes about how climate change affects our food","description":"Add these episodes to your listening rotation during the NPR Network's Climate Solutions Week, where we're dedicated to stories and conversations about the search for climate solutions.","content":"Climate change is affecting our food, and our food is affecting the climate. NPR is dedicating a week to stories and conversations about the search for solutions.\r\nLooking for solutions to our food n… [+3893 chars]","publishedAt":"2024-09-09T18:00:00Z","url":"https:\/\/www.npr.org\/2024\/09\/09\/g-s1-20267\/best-podcasts-food-climate"}
{"source":"Gizmodo.com","author":"Lucas Ropek","title":"Judge Throws the Book at Climate Activists Who Threw Soup on Van Gogh Painting","description":"Tossing a can of soup at a priceless work of art will get you time in the slammer, apparently.","content":"The two environmental activists who threw a can of tomato soup on Vincent Van Gogh’s “Sunflowers” painting have been sentenced to two years in prison.\r\nIn October of 2022, Phoebe Plummer, then 21, an… [+2699 chars]","publishedAt":"2024-09-27T20:30:17Z","url":"https:\/\/gizmodo.com\/judge-throws-the-book-at-climate-activists-who-threw-soup-on-van-gogh-painting-2000504504"}
{"source":"NPR","author":"NPR","title":"Climate Solutions Week: The future of food","description":"Climate change is affecting our food, and our food is affecting the climate. NPR is dedicating a week to stories and conversations about the search for solutions, from how we farm to what we cook to reducing food waste.","content":"September 9-15, 2024\r\nClimate experts say when it comes to global warming, pay attention to what we eat. Food and agriculture make up more than 25% of the pollution that heats our planet. What's driv… [+789 chars]","publishedAt":"2024-09-06T16:48:31Z","url":"https:\/\/www.npr.org\/2024\/09\/06\/g-s1-19303\/food-climate-solutions"}
{"source":"Business Insider","author":"Catherine Boudreau","title":"Climate crisis is helping spread deadly mosquito viruses in the US","description":"Mosquito-borne illnesses like triple E and West Nile are rising due to climate change and travel.","content":"Multiple mosquito-borne illnesses are on the rise in the US, including triple E and West Nile.Soumyabrata Roy\/Getty Images.\r\n<ul><li>Mosquito-borne illnesses are rising in the US, including triple E,… [+3158 chars]","publishedAt":"2024-09-05T13:35:50Z","url":"https:\/\/www.businessinsider.com\/west-nile-triple-e-mosquito-virus-diseases-us-2024-9"}
{"source":"NPR","author":"Brittney Melton","title":"Harris and Trump’s post-debate plans. And, why climate change puts chocolate at risk","description":"Former President Donald Trump and Vice President Harris are campaigning in swing states heavily post their first presidential debate. And, why climate change could put chocolate in danger.","content":"Good morning. You're reading the Up First newsletter. Subscribe here to get it delivered to your inbox, and listen to the Up First podcast for all the news you need to start your day.\r\nToday's top st… [+6113 chars]","publishedAt":"2024-09-13T12:05:15Z","url":"https:\/\/www.npr.org\/2024\/09\/13\/g-s1-22506\/up-first-newsletter-harris-trump-campaign-swing-states-climate-change-chocolate"}
{"source":"Harvard Business Review","author":"Solitaire Townsend, Kaya Axelsson","title":"To Incentivize Companies to Address Climate Change, Measure Their Broader Impact","description":"Current climate reporting focuses primarily on reducing carbon emissions within companies’ direct operations and value chains, often overlooking the broader impact businesses can have on society. This narrow approach fails to recognize or reward companies for…","content":"Current climate reporting focuses primarily on reducing carbon emissions within companies’ direct operations and value chains, often overlooking the broader impact businesses can have on society. Thi… [+654 chars]","publishedAt":"2024-09-06T14:00:00Z","url":"https:\/\/hbr.org\/2024\/09\/to-incentivize-companies-to-address-climate-change-measure-their-broader-impact"}
{"source":"NPR","author":"The NPR Network","title":"How we grow food affects the climate. Here are solutions communities are taking to help","description":"We've gathered examples from across the NPR Network of how we can change the food we grow to support climate goals.","content":"Climate change is affecting our food, and our food is affecting the climate. NPR is dedicating a week to stories and conversations about the search for solutions.\r\nAs NPR's climate solutions reporter… [+4249 chars]","publishedAt":"2024-09-14T18:00:00Z","url":"https:\/\/www.npr.org\/2024\/09\/14\/g-s1-22158\/climate-food-farming-solution"}
{"source":"NPR","author":"Manola Secaira","title":"California farmers turn to agave amid drought conditions and climate change","description":"Farmers in California are trying to plant crops that don't require a lot of water. Some are turning to growing agave as a response to a warming state.","content":"Climate change is affecting our food, and our food is affecting the climate. NPR is dedicating a week to stories and conversations about the search for solutions.\r\nMost of the United States' fruits a… [+12610 chars]","publishedAt":"2024-09-09T10:00:00Z","url":"https:\/\/www.npr.org\/2024\/09\/06\/nx-s1-5002056\/california-farmers-agave-drought-conditions-climate-change"}
{"source":"NPR","author":"Anna Canny","title":"Climate change makes farming easier in Alaska. Indigenous growers hope to lead the way","description":"Climate change threatens many traditional foods in Alaska. But it’s also making farming more possible. A new training program aims to help Alaska Native communities grow more of their own food.","content":"Climate change is affecting our food, and our food is affecting the climate. NPR is dedicating a week to stories and conversations about the search for solutions.\r\nGrowing up in rural Alaska, Eva Daw… [+8821 chars]","publishedAt":"2024-09-13T16:01:47Z","url":"https:\/\/www.npr.org\/2024\/09\/13\/nx-s1-5002049\/climate-change-farming-alaska-native"}
{"source":"NPR","author":"Bill Chappell","title":"A landslide linked to climate change ‘rang’ the Earth for 9 days, researchers say","description":"The scale of the geological event is like something from prehistoric times, with a tsunami 200 meters--656 feet--in height. But it happened last year. Researchers warn that similar events may reoccur.","content":"The global seismic signal was extremely unusual, and it resonated for more than a week. So its no surprise that it grabbed the attention of researchers around the world. In the end, it took 68 expert… [+3233 chars]","publishedAt":"2024-09-13T21:31:30Z","url":"https:\/\/www.npr.org\/2024\/09\/13\/g-s1-22858\/a-landslide-linked-to-climate-change-rang-the-earth-for-9-days-researchers-say"}
{"source":"NPR","author":"Alejandra Borunda","title":"Europe's intense rainfall in September twice as likely thanks to climate change","description":"Extensive early warnings and years of adaptation made the floods less deadly than they otherwise might have been.","content":"Massive rainfall inundated parts of Central and Eastern Europe in mid-September, dumping as much as two-thirds of some cities annual rain in just a few days.\r\nThe rainfall from the weather system, ca… [+5353 chars]","publishedAt":"2024-09-25T09:01:00Z","url":"https:\/\/www.npr.org\/2024\/09\/25\/nx-s1-5123674\/europes-intense-rainfall-in-september-twice-as-likely-thanks-to-climate-change"}
{"source":"The Verge","author":"Justine Calma","title":"The UK helped usher in the coal era — now its closing its last remaining plant","description":"The UK plans to close its last coal-fired power plant.","content":"The UK helped usher in the coal era now its closing its last remaining plant\r\nThe UK helped usher in the coal era now its closing its last remaining plant\r\n \/ The clock is ticking for the UKs last wo… [+3022 chars]","publishedAt":"2024-09-23T18:05:30Z","url":"https:\/\/www.theverge.com\/2024\/9\/23\/24252195\/last-coal-power-plant-close-climate-change-clean-energy"}
{"source":"NPR","author":"Clare Marie Schneider","title":"State bans on commercial food waste have been largely ineffective, study finds","description":"Much of the food supply in the U.S. goes uneaten, which contributes to climate change. Some states have tried to cut food waste in landfills, but their efforts have fallen short, researchers found.","content":"In the U.S., more than a third of the food supply goes uneaten. The waste happens at multiple levels in the production and supply chain and is a big contributor to climate change.\r\nFood that ends up … [+3332 chars]","publishedAt":"2024-09-15T10:00:00Z","url":"https:\/\/www.npr.org\/2024\/09\/14\/nx-s1-5112435\/food-waste-bans-climate-change-study"}
{"source":"Wired","author":"John Timmer, Ars Technica","title":"The UK Has No Coal-Fired Power Plants for the First Time in 142 Years","description":"With Monday's closure of Ratcliffe-on-Soar, coal is no longer being used to provide electricity in the UK.","content":"On Monday, the UK saw the closure of its last operational coal power plant, Ratcliffe-on-Soar, which has been operating since 1968. The closure of the plant, which had a capacity of 2,000 megawatts, … [+4069 chars]","publishedAt":"2024-10-01T19:52:53Z","url":"https:\/\/www.wired.com\/story\/uk-no-coal-fired-power-plants-first-time-in-142-years\/"}
{"source":"Time","author":"Rebecca Schneid and Chantelle Lee","title":"The Biggest Moments From the TIME100 Climate Leadership Forum","description":"TIME convened the first-ever TIME100 Climate Leadership Forum, featuring a series of conversations focused on driving real change toward a better, more sustainable world.","content":"Climate leaders from various fields gathered for the inaugural TIME100 Climate Leadership Forum in New York City on Monday to discuss how icons, politicians, activists, policymakers, and business lea… [+5244 chars]","publishedAt":"2024-09-24T03:55:00Z","url":"https:\/\/time.com\/7022337\/climate-leadership-forum-biggest-moments\/"}
{"source":"Yahoo Entertainment","author":null,"title":"Asheville tragedy shows there are no climate change safe havens: experts","description":null,"content":"If you click 'Accept all', we and our partners, including 240 who are part of the IAB Transparency &amp; Consent Framework, will also store and\/or access information on a device (in other words, use … [+678 chars]","publishedAt":"2024-10-01T00:35:00Z","url":"https:\/\/consent.yahoo.com\/v2\/collectConsent?sessionId=1_cc-session_de038120-78ce-426c-85f1-e29a874fa744"}
{"source":"Gizmodo.com","author":"Adam Kovac","title":"Chemists Finally Unravel the Mystery of Siberia’s Explosive Craters","description":"Underground methane blasts are behind Siberia’s puzzling exploding craters, according to new research.","content":"If you need one more reason to worry about warming global temperatures, you can add the ground spontaneously blowing up to the list.\r\nIn 2014, a bizarre crater was found in Siberias Yamal Peninsula. … [+3422 chars]","publishedAt":"2024-09-29T14:00:11Z","url":"https:\/\/gizmodo.com\/geologists-finally-unravel-the-mystery-of-siberias-explosive-craters-2000504596"}
{"source":"Wired","author":"Julian Chokkattu","title":"Google Is ‘Thinking Through’ How to Make the Pixel Watch Repairable","description":"The current version of Google's smartwatch isn't repairable, but for the first time, the company is figuring out how to fix that.","content":"If you break the Google Pixel Watchwhether the first-generation smartwatch from 2022 or the latest model launched earlier this monththere is no way to repair it through official channels. Instead, if… [+3553 chars]","publishedAt":"2024-09-24T21:56:08Z","url":"https:\/\/www.wired.com\/story\/google-is-thinking-through-the-pixel-watchs-design-to-be-repairable\/"}
{"source":"Github.io","author":"Christopher Krapu","title":"Solving climate change by abusing thermodynamic scaling laws","description":"A wintertime climate change solution","content":"TL;DR: To stop climate change, just do this - raise crops for biomass (sequestering CO2) and freeze them in huge aboveground piles during winter by running pipes through the middle. With a little ins… [+18343 chars]","publishedAt":"2024-09-29T06:17:54Z","url":"https:\/\/ckrapu.github.io\/blog\/2024\/why-dont-we-just-freeze-the-carbon\/"}
{"source":"Gizmodo.com","author":"Matt Novak","title":"Belief That EVs Are Better for the Environment Drops","description":"Back in 2022, 63% of Americans believed EVs were greener. Now it's 58%.","content":"The number of Americans who believe electric vehicles are better for the environment than cars that run on fossil fuels has dipped 5% in the past two years, according to a new poll conducted by Ipsos… [+3561 chars]","publishedAt":"2024-09-24T15:30:59Z","url":"https:\/\/gizmodo.com\/belief-that-evs-are-better-for-the-environment-drops-2000502376"}
{"source":"Time","author":"TIME PR","title":"TIME Convenes Leaders Taking Action Toward A More Sustainable World at the Inaugural TIME100 Climate Leadership Forum","description":"The TIME100 Climate Leadership Forum Features Conversations with Jane Goodall, Jacinda Ardern, Michael S. Regan, Jennifer M. Granholm and More in New York City (New York, NY—September 23, 2024) Today, TIME convenes the first-ever TIME100 Climate Leadership Fo…","content":"The TIME100 Climate Leadership Forum Features Conversations with Jane Goodall, Jacinda Ardern, Michael S. Regan, Jennifer M. Granholmand More in New York City\r\n(New York, NYSeptember 23, 2024) Today,… [+4098 chars]","publishedAt":"2024-09-23T13:10:00Z","url":"https:\/\/time.com\/7022739\/time-convenes-inaugural-time100-climate-leadership-forum\/"}
{"source":"InsideClimate News","author":"Inside Climate News","title":"Americans misunderstand their contribution to deteriorating environment","description":"A global survey suggests 88 percent of people are worried about the state of nature.","content":"Enlarge\/ Power lines are cast in silhouette as the Creek Fire creeps up on on the Shaver Springs community off of Tollhouse Road on Tuesday, Sept. 8, 2020, in Auberry, California.\r\n14\r\nThis article o… [+4947 chars]","publishedAt":"2024-09-07T11:16:56Z","url":"https:\/\/insideclimatenews.org\/news\/05092024\/global-climate-concerns-survey\/"}
{"source":"RNZ","author":"Eloise Gibson","title":"Great Barrier Reef already been dealt its death blow","description":"A leading climate scientists says it's just not possible for some ecosystems to adapt to climate change.","content":"The extensive bleaching of the Great Barrier Reef (pictured in April) was a \"death blow\" according to Dr Joëlle Gergis. Photo: DAVID GRAY \/ AFP\r\nAn Australian climate scientist has told a conference … [+2559 chars]","publishedAt":"2024-09-09T15:29:23Z","url":"https:\/\/www.rnz.co.nz\/news\/national\/527469\/great-barrier-reef-already-been-dealt-its-death-blow-scientist"}
{"source":"The Verge","author":"Justine Calma","title":"ExxonMobil deceived the public with plastic recycling, lawsuit claims","description":"California filed suit against ExxonMobil after decades of promoting plastic recycling.","content":"Seal Beach, CA - December 13: Plastic bottles and other trash are piled up along the bank of the San Gabriel River just a few hundred yards from the Pacific Ocean. | Photo: Getty Images\r\n\n \n\n ExxonMo… [+4699 chars]","publishedAt":"2024-09-23T21:30:56Z","url":"https:\/\/www.theverge.com\/2024\/9\/23\/24252433\/exxonmobil-knew-plastic-recycling-lawsuit-california"}
{"source":"BBC News","author":null,"title":"Rivals try to woo the Pacific as climate change bites","description":"As the US, China and UK try to woo Pacific Islands for geopolitical reasons, nations are more concerned about climate.","content":"The Tongan capital Nukualofa was buzzing during the Pacific Islands Forum\r\nTongas sleepy capital Nukualofa was buzzing last week as leaders from across the Pacific region descended upon it for the an… [+6263 chars]","publishedAt":"2024-09-04T21:59:40Z","url":"https:\/\/www.bbc.com\/news\/articles\/cvg5m13v9r2o"}
{"source":"BBC News","author":null,"title":"Climate change leaves future of Pacific Islands tourism 'highly uncertain'","description":"Tourist sector bosses in the region are increasingly concerned about the impact of climate change.","content":"Tourism boss Christopher Cocker says the impact of a climate change is the \"foremost threat\"\r\nThe Pacific Islands are scattered across a vast area of ocean, with some of the clearest waters in the wo… [+6484 chars]","publishedAt":"2024-09-08T23:33:29Z","url":"https:\/\/www.bbc.com\/news\/articles\/cp81l4gynljo"}
{"source":"NPR","author":"Danny McArthur","title":"These small Black-owned farms are growing crops with the climate in mind","description":"Across the Gulf South, small Black-owned farms are finding ways to use climate-friendly practices to grow crops while also addressing long-standing injustices.","content":"Climate change is affecting our food, and our food is affecting the climate. NPR is dedicating a week to stories and conversations about the search for solutions.\r\nA number of small Black-owned farms… [+6629 chars]","publishedAt":"2024-09-12T10:00:00Z","url":"https:\/\/www.npr.org\/2024\/09\/12\/nx-s1-5002077\/small-black-owned-farms-climate-change-smart-agriculture"}
{"source":"ABC News","author":"Julia Jacobo","title":"The debate proved that climate change is not at center of 2024 election: Experts","description":"Climate change continues to remain on the backburner of the 2024 election following little mention of environmental policy during the first.","content":"Climate change remains on the backburner of the 2024 election following little mention of environmental policy during the first -- and possibly only -- debate between the two presidential candidates.… [+5660 chars]","publishedAt":"2024-09-11T22:15:24Z","url":"https:\/\/abcnews.go.com\/US\/presidential-debate-proved-climate-change-center-2024-election\/story?id=113585193"}
{"source":"Yahoo Entertainment","author":"Reuters Videos","title":"Belgian climate scientists grow the pears of the future","description":"STORY: A group of climate scientists in Belgium are currently exploring what the pears of the future might be like.\"...the pears tend to be less firm and...","content":"STORY: A group of climate scientists in Belgium are currently exploring what the pears of the future might be like.\r\n\"...the pears tend to be less firm and have more sugar.\"\r\n:: THIS EARTH\r\n:: Maasme… [+2133 chars]","publishedAt":"2024-09-25T09:50:44Z","url":"https:\/\/www.yahoo.com\/news\/belgian-climate-scientists-grow-pears-095044724.html"}
{"source":"ABC News","author":"Julia Jacobo","title":"How climate change is making Florida's Big Bend more vulnerable to tropical threats","description":"Hurricane Helene is heading straight for one of the regions most vulnerable to the impact of hurricanes: Florida's Big Bend.","content":"Hurricane Helene is heading straight for one of the regions most vulnerable to hurricanes: Florida's Big Bend.\r\nHelene is expected to make landfall as a dangerous major hurricane Thursday night near … [+5753 chars]","publishedAt":"2024-09-26T23:40:59Z","url":"https:\/\/abcnews.go.com\/US\/hurricane-helene-climate-change-making-floridas-big-bend\/story?id=114183293"}
{"source":"Time","author":"Rebecca Schneid","title":"How the Climate Museum Hopes Art Will Spur Action","description":"A day at the Climate Museum during New York City's Climate Week reveals how the exhibits  imbue viewers with agency to interact with art.","content":"The first piece of art attendees will see as they head to the Climate Museums latest exhibit is a map of the world in black, white, and gray.\r\nAt first glance, the map presents which countries are pr… [+5373 chars]","publishedAt":"2024-09-26T17:45:14Z","url":"https:\/\/time.com\/7024811\/climate-museum-new-york-art-change\/"}
{"source":"Politicopro.com","author":"Scott Waldman, E&E News","title":"Presidential Debate Features Fracking while Climate Change Is Mostly Ignored","description":"Donald Trump all but ignored climate change at Tuesday’s presidential debate while Kamala Harris voiced support of both fossil fuels and increased clean energy spending","content":"CLIMATEWIRE | Vice President Kamala Harris finally mentioned the climate law she has pointedly avoided on the campaign trail — to prove she won't ban fracking.\r\n“I have not banned fracking as vice pr… [+4807 chars]","publishedAt":"2024-09-11T16:15:00Z","url":"https:\/\/subscriber.politicopro.com\/article\/eenews\/2024\/09\/11\/harris-touts-climate-law-to-highlight-fracking-00178550"}
{"source":"NPR","author":"Kimberly Winston","title":"A new kind of chaplain is helping people deal with 'climate grief'","description":"A new kind of spiritual advisor is rising among clergy trained in handling grief and other difficult emotions.","content":"TALENT, Ore. When Diane Wares home state of Oregon proposed a natural gas pipeline that threatened local waterways, she sprang into action leading workshops on lobbying state lawmakers, mentoring stu… [+11722 chars]","publishedAt":"2024-09-06T09:51:00Z","url":"https:\/\/www.npr.org\/2024\/09\/06\/nx-s1-5092402\/eco-chaplains-helping-people-deal-with-climate-grief"}
{"source":"NPR","author":"Alejandra Borunda","title":"These bakers want to make your bread tastier — with climate-resilient wheat","description":"A team of scientists and bakers in the Pacific Northwest is searching for ways to make whole wheat bread resilient to a warming world — and more delicious.","content":"Climate change is affecting our food, and our food is affecting the climate. NPR is dedicating a week to stories and conversations about the search for solutions.\r\nIts a drizzly, cold spring day outs… [+11702 chars]","publishedAt":"2024-09-10T10:00:00Z","url":"https:\/\/www.npr.org\/2024\/09\/09\/nx-s1-5002074\/bread-flour-climate-change"}
{"source":"Scientific American","author":"Sherri Goodman","title":"We Must Secure Our Future in a Hotter, More Dangerous World","description":"Defending the U.S. is much more complicated in an era of climate change","content":"Flying by helicopter over the Greenland ice sheet, I am struck by its vast expanse of whiteness. But as I look closer I see that much of the ice is dotted with bright blue pools. These pools reflect … [+6016 chars]","publishedAt":"2024-09-09T11:00:00Z","url":"https:\/\/www.scientificamerican.com\/article\/we-must-secure-our-future-in-a-hotter-more-dangerous-world\/"}
{"source":"NPR","author":"Scott Neuman","title":"Is getting food delivered worse for the climate? Sometimes it’s better","description":"From meal kits to grocery service to restaurant delivery, we look at the carbon footprint of convenient food and the choices people can make to try to reduce it. Sometimes there are trade-offs.","content":"Climate change is affecting our food, and our food is affecting the climate. NPR is dedicating a week to stories and conversations about the search for solutions.\r\nTheres a whiteboard on the refriger… [+9038 chars]","publishedAt":"2024-09-11T10:00:00Z","url":"https:\/\/www.npr.org\/2024\/09\/10\/nx-s1-5020321\/food-delivery-meal-kits-carbon-footprint"}
{"source":"Time","author":"Rebecca Schneid","title":"How Jacinda Ardern Sees Everyone as a Player in the Climate Fight","description":"The former Prime Minister of New Zealand spoke about her “expectation bias” at the inaugural TIME100 Climate Leadership Forum.","content":"Jacinda Ardern, former Prime Minister of New Zealand, is prioritizing optimism in the movement to combat the climate crisisas well as expectation for leaders to do their jobs. If we resign ourselves … [+3863 chars]","publishedAt":"2024-09-24T03:00:00Z","url":"https:\/\/time.com\/7022329\/climate-leadership-forum-jacinda-ardern-new-zealand-expectation-bias\/"}
{"source":"Time","author":"Harry Booth","title":"Sasha Luccioni","description":"About 5 years ago, Sasha Luccioni was researching ways AI could help tackle climate change when a single question prompted her to rethink: What if AI was part of the problem? “Every time you do a Google search, you don’t know how much energy that’s using. Eve…","content":"About 5 years ago, Sasha Luccioni was researching ways AI could help tackle climate change when a single question prompted her to rethink: What if AI was part of the problem? \r\nEvery time you do a Go… [+1530 chars]","publishedAt":"2024-09-05T11:24:03Z","url":"https:\/\/time.com\/7012753\/sasha-luccioni\/"}
{"source":"The Atlantic","author":"Karen Hao","title":"Microsoft’s Hypocrisy on AI","description":"Can artificial intelligence really enrich fossil-fuel companies and fight climate change at the same time? The tech giant says yes.","content":"Microsoft executives have been thinking lately about the end of the world. In a white paper published late last year, Brad Smith, the company’s vice chair and president, and Melanie Nakagawa, its chi… [+16127 chars]","publishedAt":"2024-09-13T10:00:00Z","url":"https:\/\/www.theatlantic.com\/technology\/archive\/2024\/09\/microsoft-ai-oil-contracts\/679804\/"}
{"source":"BBC News","author":null,"title":"How the world’s smelliest fruit is making coffee more expensive","description":"A \"perfect storm\" of economic and environmental factors in coffee-producing regions is pushing up prices.","content":"How much is too much for a caffeine fix?\r\nPrices like £5 in London or $7 in New York for a cup of coffee may be unthinkable for some - but could soon be a reality thanks to a \"perfect storm\" of econo… [+5416 chars]","publishedAt":"2024-09-15T02:33:23Z","url":"https:\/\/www.bbc.com\/news\/articles\/c5y37dvlr70o"}
{"source":"The New Yorker","author":"Rebecca Mead","title":"Can Your Stomach Handle a Meal at Alchemist?","description":"At the Copenhagen restaurant, diners are served raw jellyfish—and freeze-dried lamb brain served in a fake cranium—while videos about climate change swirl on the ceiling. Is it “gastronomic opera,” or sensory overload?","content":"Rasmus Munk, the celebrated Danish chef, has such memorable eyesthey are a piercing blue, and often bloodshotthat when a waiter at Alchemist, his restaurant in Copenhagen, served me an eyeball, I rec… [+17238 chars]","publishedAt":"2024-09-23T10:00:00Z","url":"https:\/\/www.newyorker.com\/magazine\/2024\/09\/30\/can-your-stomach-handle-a-meal-at-alchemist"}
{"source":"NPR","author":"Rebecca Hersher","title":"Abnormally warm water helped Helene rapidly intensify and suck up moisture","description":"Helene is dumping rain across the Southeast, after coming ashore as a powerful Category 4 storm. Abnormally warm water in the Gulf of Mexico helped it rapidly intensify and suck up moisture.","content":"Follow NPR's live updates for the latest on the impact of Helene.\r\nIn the two days before it hit Florida, Hurricane Helene grew from a relatively weak tropical storm into a major Category 4 hurricane… [+1841 chars]","publishedAt":"2024-09-27T16:01:46Z","url":"https:\/\/www.npr.org\/2024\/09\/27\/nx-s1-5130849\/helene-category-4-fast-warm-water-climate-change"}
{"source":"BBC News","author":null,"title":"More than 80 dead in Vietnam super typhoon","description":"The most powerful storm to hit the country in 30 years has also left thousands stranded.","content":"At least 82 people have now died in Vietnam as a super typhoon which hit on Saturday continues to bring heavy rainfall, landslides and flooding.\r\nThousands of people were seen stranded on rooftops in… [+1785 chars]","publishedAt":"2024-09-10T10:14:53Z","url":"https:\/\/www.bbc.com\/news\/articles\/cql3qvg3vk9o"}
{"source":"Time","author":"Chantelle Lee and Rebecca Schneid","title":"How Public and Private Sector Leaders Are Tackling Climate Equity","description":"EPA Administrator Michael S. Regan, RISE St. James CEO Sharon Lavigne, and Apple executive Lisa Jackson spoke during a panel at the TIME100 Climate Leadership Forum.","content":"Sharon Lavigne knows first-hand the effects of climate change. At the inaugural TIME100 Climate Leadership Forum in New York City on Monday, the founder, director, and CEO of the faith-based grassroo… [+3296 chars]","publishedAt":"2024-09-24T04:30:00Z","url":"https:\/\/time.com\/7022333\/climate-leadership-forum-equity\/"}
{"source":"CNN","author":"Laura Paddison, CNN","title":"The controversial plan to turn a desert green","description":"A Dutch engineer wants to transform an expanse of arid land into green, fertile land teeming with wildlife — and in the process, change the weather","content":"Ties van der Hoevens ambitions are nothing if not grand. The Dutch engineer wants to transform a huge stretch of inhospitable desert into green, fertile land teeming with wildlife.\r\nHis sights are se… [+9912 chars]","publishedAt":"2024-09-08T13:00:21Z","url":"https:\/\/www.cnn.com\/2024\/09\/08\/climate\/regreen-desert-sinai-egypt\/index.html"}
{"source":"NPR","author":"Nell Greenfieldboyce","title":"Why the most climate-resistant glaciers are hiding in plain sight","description":"In the American West, white glaciers and snow fields are outnumbered by long-overlooked “rock glaciers.” The rock covering these vast hunks of ice makes them far less affected by warming temperatures.","content":"In the Wasatch mountains near Salt Lake City, Utah, a popular hiking trail winds up through aspen and spruce trees to reach White Pine Lake.\r\nScott Hotaling is marching up this familiar path, but pas… [+7662 chars]","publishedAt":"2024-09-30T18:54:32Z","url":"https:\/\/www.npr.org\/2024\/09\/30\/nx-s1-5109050\/climate-resistant-glaciers-hold-water-cooler-temperatues"}
{"source":"The Verge","author":"Jennifer Pattison Tuohy","title":"Sleep Number’s newest smart bed aims to tackle night sweats","description":"The company says its newest smart bed can actively cool and adapt to both sleepers’ temperature needs throughout the night.","content":"Sleep Numbers newest smart bed aims to tackle night sweats\r\nSleep Numbers newest smart bed aims to tackle night sweats\r\n \/ The ClimateCool can actively cool you and adjust to your temperature through… [+3346 chars]","publishedAt":"2024-10-01T18:59:20Z","url":"https:\/\/www.theverge.com\/2024\/10\/1\/24259440\/sleep-number-climate-cool-smart-bed-price-features"}
{"source":"Hacker News","author":null,"title":"Autarc (YC S24) Is Hiring a Software Engineer to Fight Climate Change","description":"Comments","content":"We're looking for a senior full-stack software engineer based in Germany who wants to directly tackle climate change by building a local-first React\/CapacitorJS\/TypeScript\/RxDB\/Supabase app.We're aut… [+657 chars]","publishedAt":"2024-10-01T07:00:32Z","url":"https:\/\/news.ycombinator.com\/item?id=41705391"}
{"source":"Gizmodo.com","author":"Passant Rabie","title":"Intense Flooding Expected as Florida Faces Possible Category 4 Hurricane Tonight","description":"Helene will make landfall Thursday evening, bringing about life-threatening conditions across the northwest coast.","content":"An unusually large storm is headed towards the coast of Florida, gaining strength as it travels along the Gulf of Mexico before it’s predicted to make landfall on Thursday evening.\r\nHurricane Helene … [+2758 chars]","publishedAt":"2024-09-26T19:53:01Z","url":"https:\/\/gizmodo.com\/intense-flooding-expected-as-florida-faces-possible-category-4-hurricane-tonight-2000503906"}
{"source":"Time","author":"Johan Rockström","title":"Planet Earth Is in Critical Condition. These are the Steps the World Must Take to Change That","description":"The Planetary Health Check is a key monitor of earth's vital signs—and will guide action for a more sustainable world.","content":"The results of the planets first annual physicala complete health checkare in, and they are alarming. We are deep into the yellow danger zone and moving rapidly towards the red high-risk zone, where … [+8467 chars]","publishedAt":"2024-10-02T16:00:45Z","url":"https:\/\/time.com\/7027847\/planet-earth-critical-condition-solutions\/"}
{"source":"NPR","author":"Julia Simon","title":"Eating less beef is a climate solution. Here's why that's hard for some American men","description":"Climate researchers have long grappled with how to get Americans to eat less beef, a food with a huge global warming impact. Now some are thinking about it through the lens of gender.","content":"Climate change is affecting our food, and our food is affecting the climate. NPR is dedicating a week to stories and conversations about the search for solutions.\r\nIn 2006, when Malcolm Regisford was… [+19961 chars]","publishedAt":"2024-09-15T11:00:00Z","url":"https:\/\/www.npr.org\/2024\/09\/14\/nx-s1-5003066\/beef-climate-change-american-men-masculinity"}
{"source":"Politicopro.com","author":"Ariel Wittenberg, E&E News","title":"Hurricanes Helene’s Floods Swamped a Hospital, Highlighting Climate Threats to Health Care","description":"Hurricane Helene forced dozens of medical facilities across the southern U.S. to evacuate patients, underscoring the human costs of climate change","content":"CLIMATEWIRE | A dramatic helicopter evacuation of a Tennessee hospital Friday, as raging floodwaters from Hurricane Helene surrounded the building, underscores what health experts say are rising dang… [+10846 chars]","publishedAt":"2024-10-02T18:45:00Z","url":"https:\/\/subscriber.politicopro.com\/article\/eenews\/2024\/10\/02\/a-dangerous-rescue-helene-made-a-hospital-almost-inescapable-00181734"}
{"source":"Yahoo Entertainment","author":null,"title":"‘Short corn’ could replace the towering cornfields steamrolled by a changing climate","description":null,"content":"If you click 'Accept all', we and our partners, including 239 who are part of the IAB Transparency &amp; Consent Framework, will also store and\/or access information on a device (in other words, use … [+678 chars]","publishedAt":"2024-09-23T14:01:39Z","url":"https:\/\/consent.yahoo.com\/v2\/collectConsent?sessionId=1_cc-session_70f6852b-b22b-4816-a1bc-5f299af0e211"}
{"source":"Ars Technica","author":"John Timmer","title":"New study takes the Earth’s temperature over a half-billion years","description":"With one exception, a strong link between carbon dioxide and global temperatures.","content":"Enlarge\/ The cycle of building and breaking up of supercontinents seems to drive long-term climate trends.\r\n2\r\nGlobal temperature records go back less than two centuries. But that doesn't mean we hav… [+4325 chars]","publishedAt":"2024-09-20T15:24:51Z","url":"https:\/\/arstechnica.com\/science\/2024\/09\/new-study-takes-the-earths-temperature-over-a-half-billion-years\/"}
{"source":"BBC News","author":null,"title":"Climate a more fundamental threat than terror - Lammy","description":"Foreign Secretary David Lammy vows to put climate change at the heart of the UK's foreign policy.","content":"The foreign secretary has said climate change is a more pervasive and fundamental threat than terrorism.\r\nIn his maiden speech, 100 days after taking office, David Lammy said the climate issue, along… [+4455 chars]","publishedAt":"2024-09-17T13:06:38Z","url":"https:\/\/www.bbc.com\/news\/articles\/c62d477yg95o"}
{"source":"NPR","author":"The NPR Network","title":"Sustainable eating habits that can help the environment without taking over your life","description":"What we eat plays a role in the health of our environment. Here are some things to consider when trying to make doable changes to improve your impact without breaking the bank.","content":"Climate change is affecting our food, and our food is affecting the climate. NPR is dedicating a week to stories and conversations about the search for solutions.\r\nWhat we eat plays a role in the hea… [+5567 chars]","publishedAt":"2024-09-12T12:00:00Z","url":"https:\/\/www.npr.org\/2024\/09\/12\/g-s1-21786\/sustainable-food-vegan-local"}
{"source":"NPR","author":"Lauren Sommer","title":"Climate change is coming for your wine","description":"In California's Napa Valley, the nation's unofficial wine capital, one varietal reigns supreme: cabernet sauvignon. But climate change is threatening the small blue-black grapes for which cabernet sauvignon is named. Increasingly severe heat waves are taking …","content":"In hotter temperatures, cabernet grapes lose their rich red color and produce sweeter, more alcoholic wines.\r\nRyan Kellman\/NPR\r\nClimate change is affecting our food, and our food is affecting the cli… [+2127 chars]","publishedAt":"2024-09-09T07:00:59Z","url":"https:\/\/www.npr.org\/2024\/09\/09\/1198910728\/heat-climate-change-wine"}
{"source":"Time","author":"Justin Worland","title":"The Market Signal Sent By Trump and Harris on Climate During the Debate","description":"The debate offered an opportunity to evaluate where climate policy under Trump or Harris, and, to an extent, the market may be going.","content":"(To get this story in your inbox, subscribe to the TIME CO2 Leadership Report newsletter here.)\r\nWhen President Biden entered the White House in 2021, before his administration had written any new re… [+4282 chars]","publishedAt":"2024-09-13T16:04:57Z","url":"https:\/\/time.com\/7020975\/the-market-signal-sent-by-trump-and-harris-on-climate-during-the-debate\/"}
{"source":"Time","author":"Ayana Elizabeth Johnson","title":"How We Can Move Away From the Climate Brink","description":"Ayana Elizabeth Johnson explores what climate success could look like—if only we let it.","content":"It will take momentous shifts to ensure a reasonably safe climate future. How can we find the wherewithal and endurance to transform our energy, food, and transportation systems; our buildings, infra… [+14169 chars]","publishedAt":"2024-09-17T15:44:20Z","url":"https:\/\/time.com\/7021972\/climate-future-ayana-elizabeth-johnson-essay\/"}
{"source":"CNET","author":"Erin Gobler","title":"How to Protect Your Home During Hurricanes and Other Major Storms","description":"Hurricanes may be getting stronger due to climate change. We'll show you how to keep yourself and your home safe.","content":"Though we're nearing the end of hurricane season for the East Coast of the US, an August report from the National Oceanic and Atmospheric Administration predicted four to seven more hurricanes for th… [+5735 chars]","publishedAt":"2024-09-25T21:00:07Z","url":"https:\/\/www.cnet.com\/home\/energy-and-utilities\/how-to-protect-your-home-during-hurricanes-and-other-major-storms\/"}
{"source":"Yahoo Entertainment","author":"SETH BORENSTEIN","title":"Pollution of the potent warming gas methane soars and people are mostly to blame","description":"The amount and proportion of the powerful heat-trapping gas methane that humans spew into the atmosphere is rising, helping to turbocharge climate change, a ...","content":"The amount and proportion of the powerful heat-trapping gas methane that humans spew into the atmosphere is rising, helping to turbocharge climate change, a new study finds.\r\nTuesdays study finds tha… [+4333 chars]","publishedAt":"2024-09-10T07:56:27Z","url":"https:\/\/www.yahoo.com\/news\/pollution-potent-warming-gas-methane-075627841.html"}
{"source":"NPR","author":"Rebecca Hersher","title":"He survived the water, but not the flood","description":"Climate-driven flooding destroyed Tony Calhoun’s home in 2022. But as the water receded, his despair only grew. Now, his family hopes to bring attention to the mental health toll of extreme weather.","content":"If you or someone you know is in crisis, please call, text or chat with the Suicide and Crisis Lifeline at 988.\r\nTony Calhoun was unique. Anyone who knew him would tell you that.\r\nOn one hand, there … [+9303 chars]","publishedAt":"2024-09-17T09:00:00Z","url":"https:\/\/www.npr.org\/2024\/09\/17\/nx-s1-5051826\/remembering-kentucky-flood-victim-tony-calhoun"}
{"source":"BBC News","author":null,"title":"Myanmar hit by deadly floods after Typhoon Yagi","description":"Myanmar's ruling junta has requested foreign aid as large areas are inundated, state-run media report.","content":"Severe flooding has hit Myanmar after Typhoon Yagi, with more than 230,000 people forced to flee their homes, according to officials.\r\nThe country's ruling junta has requested foreign aid to mitigate… [+2028 chars]","publishedAt":"2024-09-14T04:55:07Z","url":"https:\/\/www.bbc.com\/news\/articles\/ckgn1yrkyppo"}
{"source":"BBC News","author":null,"title":"King to attend barbecue and meet PM on Australia trip","description":"The King will travel to Australia on his biggest trip overseas since he began treatment for cancer.","content":"King Charles III and Queen Camilla will sample a traditional barbecue, along with more formal ceremonial engagements, when they visit Australia next month.\r\nThe trip will be the King's biggest overse… [+2167 chars]","publishedAt":"2024-09-10T15:22:24Z","url":"https:\/\/www.bbc.com\/news\/articles\/cp35en2971go"}
{"source":"Yahoo Entertainment","author":"RICK BOWMER and MARK THIESSEN","title":"Climate change destroyed an Alaska village. Its residents are starting over in a new town","description":"Growing up along the banks of the Ninglick River in western Alaska, Ashley Tom would look out of her window after strong storms from the Bering Sea hit her...","content":"MERTARVIK, Alaska (AP) Growing up along the banks of the Ninglick River in western Alaska, Ashley Tom would look out of her window after strong storms from the Bering Sea hit her village and notice s… [+8385 chars]","publishedAt":"2024-09-26T13:37:28Z","url":"https:\/\/www.yahoo.com\/news\/climate-change-destroyed-alaska-village-133728537.html"}
{"source":"Science Daily","author":null,"title":"Report exposes worsening health threats of climate change in UK","description":"A new report has revealed the wide-ranging and increasing health dangers posed by long-term weather extremes in the UK, as the effects of climate change deepen.","content":"A new report has revealed for the first time the wide-ranging and increasing health dangers posed by long-term weather extremes in the UK, as the effects of climate change deepen.The review, publishe… [+3330 chars]","publishedAt":"2024-09-05T18:35:59Z","url":"https:\/\/www.sciencedaily.com\/releases\/2024\/09\/240905143559.htm"}
{"source":"Gizmodo.com","author":"Ed Cara","title":"Invasive Ticks Carrying New Diseases Are Spreading Through the Northeast","description":"Scientists are reporting the first human case of Rickettsia parkeri bacteria in Connecticut and the greater Northeast region.","content":"New species of ticks are moving to the Northeastern U.S.and bringing along unfriendly visitors with them. In a recent study, scientists have reported the first human case of a particular tickborne ba… [+6371 chars]","publishedAt":"2024-10-01T20:41:49Z","url":"https:\/\/gizmodo.com\/invasive-ticks-carrying-new-diseases-are-spreading-through-the-northeast-2000505769"}
{"source":"Yahoo Entertainment","author":"Rod Gilmour","title":"'All politicians should be forced into space to see Earth's beauty'","description":"Rachel Delacour is founder of climate tech firm Sweep. She sold her first company, BIME Analytics,  for $45m in 2015.","content":"Co-founder Rachel Delacour decided to pour all her energy into building carbon management software.\r\nRachel Delacour is founder of climate tech firm Sweep, which works with brands including LOreal (L… [+4318 chars]","publishedAt":"2024-09-13T05:00:04Z","url":"https:\/\/uk.finance.yahoo.com\/news\/climate-tech-sweep-environment-050004481.html"}
{"source":"NPR","author":"The NPR Network","title":"Creative ways communities are reducing food waste","description":"While lots of powerful changes to reduce food waste can start at home, sometimes the scale of the problem benefits from a community-wide approach.","content":"Climate change is affecting our food, and our food is affecting the climate. NPR is dedicating a week to stories and conversations about the search for solutions.\r\nWhen we started working on this yea… [+4024 chars]","publishedAt":"2024-09-15T14:00:00Z","url":"https:\/\/www.npr.org\/2024\/09\/15\/g-s1-20752\/compost-food-waste-community"}
{"source":"NPR","author":"Regina G. Barber","title":"Why Astronomy 101 is 'perfect' for teaching climate change","description":"Years ago, astronomy professors started noticing something that troubled them: Many of their students didn't understand climate change and the science supporting it. So a small group of professors decided to do something about it — teach climate change in the…","content":"Astronomy professors across the country are integrating climate change lessons into one of their most wide-reaching and popular courses: Introduction to Astronomy.\r\nMark Garlick\/Science Photo Library… [+2975 chars]","publishedAt":"2024-10-02T07:00:59Z","url":"https:\/\/www.npr.org\/2024\/10\/02\/1202966835\/climate-change-astronomy-college-education"}
{"source":"Undark Magazine","author":"Undark Magazine","title":"The Golden Age of offbeat Arctic research","description":"The Cold War spawned some odd military projects that were doomed to fail.","content":"Enlarge\/ At the US Armys Camp Century on the Greenland ice sheet, an Army truck equipped with a railroad wheel conversion rides on 1,300 feet of track under the snow.\r\n2\r\nIn recent years, the Arctic … [+3369 chars]","publishedAt":"2024-09-08T11:12:24Z","url":"https:\/\/undark.org\/2024\/09\/06\/wilo-golden-age-offbeat-arctic-research\/"}
{"source":"The Atlantic","author":"Zoë Schlanger","title":"The Climate Question the Next President Will Have to Answer","description":"How will they help Americans deal with the extreme weather battering the country?","content":"Tonight’s presidential debate was held while wildfires rage in Nevada, Southern California, Oregon, and Idaho. Louisiana is bracing for a possible hurricane landfall. After a year of floods and storm… [+6862 chars]","publishedAt":"2024-09-11T03:50:17Z","url":"https:\/\/www.theatlantic.com\/science\/archive\/2024\/09\/trump-harris-debate-climate-change\/679778\/"}
{"source":"Time","author":"Harry Booth and Video by Joey Lautrup","title":"Cities Are on the Front Line of the ‘Climate-Health Crisis.’ A New Report Provides a Framework for Tackling Its Effects","description":"Less than a third of cities have a resilience plan that integrates climate and health, a Rockefeller Foundation found. It highlights success stories that could show a path forward.","content":"The World Health Organization (WHO) estimates that extreme heat kills almost half a million people each yearmore than war, terrorism and malnutrition combined. That number is likely to rise as the cl… [+10261 chars]","publishedAt":"2024-09-26T16:00:53Z","url":"https:\/\/time.com\/7024639\/cities-climate-health\/"}
{"source":"Science Daily","author":null,"title":"Thinking about the future: Examining the exacerbating and attenuating factors of despair-induced climate burnout","description":"New research explored the exacerbating and attenuating factors of despair-induced climate burnout to learn how people can overcome despair and maintain motivation to fight climate change.","content":"As the occurrence of weather extremes continues to escalate, the climate change movement now grapples with a new challenge, 'climate burnout'.The troubling trend of despair and fatigue among those wh… [+2762 chars]","publishedAt":"2024-09-25T16:36:34Z","url":"https:\/\/www.sciencedaily.com\/releases\/2024\/09\/240925123634.htm"}
{"source":"NPR","author":"The NPR Network","title":"Not sure what to make for dinner? Here are recipes to help you eat sustainably","description":"Finding meals that are good for you, your wallet and the environment can be difficult. We've pulled together a few recipes to make sustainable choices even easier.","content":"Climate change is affecting our food, and our food is affecting the climate. NPR is dedicating a week to stories and conversations about the search for solutions.\r\nDeciding what to make for dinner ca… [+2254 chars]","publishedAt":"2024-09-15T14:00:00Z","url":"https:\/\/www.npr.org\/2024\/09\/15\/g-s1-21888\/recipes-seasonal-plant-based"}
{"source":"Slashdot.org","author":"msmash","title":"Europe's Farming Lobbies Recognize Need To Eat Less Meat in Shared Vision Report","description":"Europe's food and farming lobbies have recognized the need to eat less meat after hammering out a shared vision for the future of agriculture with green groups and other stakeholders. From a report: The wide-ranging report calls for \"urgent, ambitious and fea…","content":"The wide-ranging report calls for \"urgent, ambitious and feasible\" change in farm and food systems and acknowledges that Europeans eat more animal protein than scientists recommend. It says support i… [+1400 chars]","publishedAt":"2024-09-04T15:25:00Z","url":"https:\/\/news.slashdot.org\/story\/24\/09\/04\/1449256\/europes-farming-lobbies-recognize-need-to-eat-less-meat-in-shared-vision-report"}
{"source":"Gizmodo.com","author":"Adam Kovac","title":"Earth Mysteriously Shook for 9 Days Last Year. Scientists Finally Know What Happened.","description":"The strange, imperceptible tremor mystified geologists, but a vast team of researchers says it has cracked the case.","content":"For over a week in 2023, the planet got the shakes and nobody knew why. Now, geologists believe a fjord in Greenland is to blame for the odd seismological event.\r\nYou likely didnt notice the quaverin… [+2814 chars]","publishedAt":"2024-09-13T14:05:52Z","url":"https:\/\/gizmodo.com\/earth-mysteriously-shook-for-9-days-last-year-scientists-finally-know-what-happened-2000498258"}
{"source":"Gizmodo.com","author":"Adam Kovac","title":"The Surprising Ingredient That Helped Polynesians Conquer the Pacific","description":"Ancient Polynesians were encouraged to settle new territories because they had a reliable and hardy crop, new research suggests.","content":"Sweet potatoes are a very versatile tuber. You can roast them. You can bake them into a pie. You can turn them into the third best type of french fry. And apparently, you can make them an integral pa… [+2849 chars]","publishedAt":"2024-09-25T23:01:34Z","url":"https:\/\/gizmodo.com\/the-surprising-ingredient-that-helped-polynesians-conquer-the-pacific-2000503199"}
{"source":"Gizmodo.com","author":"James Whitbrook","title":"Lego Promises It’s Keeping Physical Instructions After Survey Backlash","description":"A customer survey suggesting a move to digital-only building instructions was pulled earlier this week after fan fury.","content":"In recent years Lego has made strides to try and mitigate the impact of its plastic brick empire on the planet, from attempts at making its bricks more environmentally friendly, to slowly bringing in… [+3123 chars]","publishedAt":"2024-09-20T16:27:02Z","url":"https:\/\/gizmodo.com\/lego-digital-instructions-survey-backlash-2000501405"}
{"source":"Gizmodo.com","author":"Adam Kovac","title":"New Map Shows Where You’re Most Likely to Encounter Landslides in the US","description":"Bad news if you're on the West Coast, Alaska, or Puerto Rico. Great news if you live in Florida.","content":"If you see your reflection in the snow covered hills, it might be time to check out a new map from the United States Geological Survey. The map reveals that a surprisingly large part of the country i… [+3449 chars]","publishedAt":"2024-09-12T15:55:00Z","url":"https:\/\/gizmodo.com\/new-map-shows-where-youre-most-likely-to-encounter-landslides-in-the-us-2000498027"}
{"source":"The Conversation Africa","author":"Kyle Hilburn, The Conversation","title":"How Wildfires Create Rain and Change the Weather","description":"Because wildfires create their own wind patterns, they can also spawn their own weather. Here’s how it works","content":"The following essay is reprinted with permission from The Conversation, an online publication covering the latest research.Wildfire blowups, fire whirls, towering thunderstorms: When fires get large … [+5292 chars]","publishedAt":"2024-09-09T19:10:00Z","url":"https:\/\/theconversation.com\/wildfires-can-create-their-own-weather-including-thunderstorms-and-tornado-like-fire-whirls-an-atmospheric-scientist-explains-how-235845"}
{"source":"BBC News","author":null,"title":"Smear campaign against celebrity-endorsed nature reserve exposed","description":"How did a Philippine nature reserve get caught up in an information battle?","content":"A nature reserve in the Philippines, which has been lauded by top climate activists and film stars, has come under a concerted disinformation attack on social media as it fights to continue its work,… [+7624 chars]","publishedAt":"2024-09-28T00:18:25Z","url":"https:\/\/www.bbc.com\/news\/articles\/cp39zvv6kl4o"}
{"source":"Futurity: Research News","author":"James Devitt-NYU","title":"Patriotic messages can boost support for climate change action","description":"Framing climate action as patriotic and status-quo friendly increases liberals' and conservatives' belief in climate change, research finds.","content":"A new study shows that framing the need to address climate change as patriotic and as necessary to preserve the American “way of life” can increase belief in climate change and support for pro-enviro… [+4004 chars]","publishedAt":"2024-09-16T18:19:35Z","url":"https:\/\/www.futurity.org\/climate-change-action-patriotic-liberals-conservatives-3248752\/"}
{"source":"BBC News","author":null,"title":"Mine water could heat thousands of Welsh homes","description":"Energy bills could be cut by low carbon heat schemes which use water from abandoned Welsh coal mines.","content":"Mine water at the former Six Bells colliery in Abertillery is pumped 40m [131ft] to the surface where it is cleaned and treated\r\nEnergy bills could be cut by low carbon heat schemes which use water f… [+4222 chars]","publishedAt":"2024-09-10T22:00:10Z","url":"https:\/\/www.bbc.com\/news\/articles\/c0l867k70p8o"}
{"source":"NPR","author":"Lauren Sommer","title":"Hurricanes are dangerous far from the coast. Communities are struggling to prepare","description":"Coastal cities often bear the brunt of hurricanes. But as Hurricane Helene showed, extreme rainfall can be life-threatening hundreds of miles away.","content":"Hurricane Helenes destructive path tore across several states, causing the ocean surge on the Florida coast and cutting off power supplies in Georgia. But the heaviest rainfall, and some of the worst… [+6076 chars]","publishedAt":"2024-10-02T09:00:00Z","url":"https:\/\/www.npr.org\/2024\/10\/01\/nx-s1-5133530\/hurricane-helene-rain-flooding-climate-change"}
{"source":"Slashdot.org","author":"BeauHD","title":"Pacific Islands Submit Court Proposal For Recognition of Ecocide As a Crime","description":"Vanuatu, Fiji, and Samoa have proposed a change to the International Criminal Court (ICC) to recognize ecocide as a crime, allowing for the prosecution of individuals responsible for significant environmental harm. If successful, the change would recognize ec…","content":"Vanuatu, Fiji and Samoa have proposed a formal recognition by the court of the crime of ecocide, defined as \"unlawful or wanton acts committed with knowledge that there is a substantial likelihood of… [+1987 chars]","publishedAt":"2024-09-10T01:25:00Z","url":"https:\/\/yro.slashdot.org\/story\/24\/09\/09\/239227\/pacific-islands-submit-court-proposal-for-recognition-of-ecocide-as-a-crime"}
{"source":"Abduzeedo.com","author":"abduzeedo","title":"7Analytics: Data-Driven Branding for Climate Solutions","description":"7Analytics: Data-Driven Branding for Climate Solutions\n \n\n\n abduzeedo0918—24\n\n Discover how Studio Oker crafted a data-inspired branding and visual identity for 7Analytics, a climate tech leader. Explore the fusion of design and data visualization.\r\n\nStudio O…","content":"Discover how Studio Oker crafted a data-inspired branding and visual identity for 7Analytics, a climate tech leader. Explore the fusion of design and data visualization.\r\nStudio Oker's recent collabo… [+1977 chars]","publishedAt":"2024-09-18T16:03:44Z","url":"https:\/\/abduzeedo.com\/node\/88607"}
{"source":"Science Daily","author":null,"title":"Climate change likely to increase diarrheal disease hospitalizations by 2100s in Dhaka, Bangladesh","description":"By 2100, hospitalizations from diarrheal diseases are predicted to increase in the city of Dhaka in Bangladesh as a result of climate change, even if global warming stays under 2 degrees Celsius, according to a new study.","content":"By 2100, hospitalizations from diarrheal diseases are predicted to increase in the city of Dhaka in Bangladesh as a result of climate change, even if global warming stays under 2 degrees Celsius. Far… [+2070 chars]","publishedAt":"2024-09-26T18:48:44Z","url":"https:\/\/www.sciencedaily.com\/releases\/2024\/09\/240926144844.htm"}
{"source":"Science Daily","author":null,"title":"One in two El Niño events could be extreme by mid-century","description":"Climate change from greenhouse gas emissions could make extreme El Nino events more frequent, according to new research.","content":"With the climate pattern known as El Niño in full force from mid-2023 to mid-2024, global temperatures broke records for 12 months in a row. As one of the strongest El Niño events on record, it was l… [+4839 chars]","publishedAt":"2024-09-25T16:36:47Z","url":"https:\/\/www.sciencedaily.com\/releases\/2024\/09\/240925123647.htm"}
